src/main/resources/bamboo_seat_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sim="http://www.ibsplc.com/iRes/simpleTypes/">
    <soapenv:Header/>
    <soapenv:Body>
        <sim:ShowSeatMapRQ>
            <AirlineCode>QH</AirlineCode>
            <SegmentInfo>
                <BoardPoint>SGN</BoardPoint>
                <OffPoint>HAN</OffPoint>
            </SegmentInfo>
            <BookingChannel>
                <!--Optional:-->
                <ChannelType>API</ChannelType>
                <!--Optional:-->
                <Channel>MOMO</Channel>
                <!--Optional:-->
                <Locale>en_US</Locale>
            </BookingChannel>
            <FlightIdentifier>
                <fltNumber>202</fltNumber>
                <airlineCode>QH</airlineCode>
                <flightDate>
                    <Date>2021-05-30Z</Date>
                </flightDate>
                <fltSuffix>*</fltSuffix>
                <carrierCode>QH</carrierCode>
            </FlightIdentifier>
            <isSeatFeeRequired>true</isSeatFeeRequired>
            <PointOfSale>VN</PointOfSale>
        </sim:ShowSeatMapRQ>
    </soapenv:Body>
</soapenv:Envelope>